rfloyd01/PersonalCaddie/Firmware/nRF52840_Drivers/main.c
static void error_notification(int err_code)
{
    //This method is used to alert the front end application of nRF errors that have occured.
    //This happens by putting the error code into a characteristic and sending it via a
    //notification.
    ble_gatts_hvx_params_t err_notify_params;
    memset(&err_notify_params, 0, sizeof(err_notify_params));

    uint16_t err_characteristic_size = 4; //currently only error codes less than or equal to 4 bytes can be sent

    //Convert the error code into a byte array
    uint8_t err_array[4];
    uint8_t* err_start = (uint8_t*)&err_code; //cast the float to a 32-bit integer to take up 4 array slots
    for (int i = 0; i < 4; i++) err_array[i] = *(err_start + i);

    //Setup accelerometer notification first
    err_notify_params.type = BLE_GATT_HVX_NOTIFICATION;
    err_notify_params.handle = m_pc.error_handle.value_handle;
    err_notify_params.p_data = err_array;
    err_notify_params.p_len  = &err_characteristic_size;
    err_notify_params.offset = 0;

    uint32_t ret = sd_ble_gatts_hvx(m_conn_handle, &err_notify_params); //acc data notification
    APP_ERROR_CHECK(ret);
}

static uint32_t data_notification_error_handler(uint32_t* ret)
{
    //This method is for handling common errors that happen during notification
    //and shouldn't crash the application.
    if (*ret == BLE_ERROR_GATTS_SYS_ATTR_MISSING)
    {
        //This error will pop up during a secure connection when we aren't sure who
        //the sender is (this happens when we try to send notifications without first
        //setting the CCCD to notify from the app). Calling the below method should fix
        //things.
        *ret = sd_ble_gatts_sys_attr_set(m_conn_handle, NULL, 0, 0);
        APP_ERROR_CHECK(*ret);
    }
    else if (*ret == NRF_ERROR_RESOURCES)
    {
        //This error occurs when there are more notifcations than allowed in the queue.
        //This can happen if a notification fails to send and we need to resend it, but 
        //more data comes in before this occurs. In this case we set the m_notification
        //complete boolean to false, and wait for it to get set to true in the BLE stack
        //handler (this will happen automatically when the next notification goes out).
        m_notification_done = false;
        SEGGER_RTT_WriteString(0, "Notification queue is full.\n");
        *ret = 0x69; //a great error code
    }
}

static void characteristic_update_and_notify()
{
    ble_gatts_hvx_params_t acc_notify_params, gyr_notify_params, mag_notify_params;
    memset(&acc_notify_params, 0, sizeof(acc_notify_params));
    memset(&gyr_notify_params, 0, sizeof(gyr_notify_params));
    memset(&mag_notify_params, 0, sizeof(mag_notify_params));

    uint16_t acc_data_characteristic_size = 5 + MAX_SENSOR_SAMPLES * SAMPLE_SIZE;
    uint16_t gyr_data_characteristic_size = 5 + MAX_SENSOR_SAMPLES * SAMPLE_SIZE;
    uint16_t mag_data_characteristic_size = 5 + MAX_SENSOR_SAMPLES * SAMPLE_SIZE;

    //Add the time stamp for the current data set and current number of 
    //samples to the end of each of the data characteristics.
    for (int i = 0; i < 4; i++)
    {
        uint8_t* time_start = (uint8_t*)&m_time_stamp; //cast the float to a 32-bit integer to take up 4 array slots

        acc_characteristic_data[MAX_SENSOR_SAMPLES * SAMPLE_SIZE + i] = *(time_start + i);
        gyr_characteristic_data[MAX_SENSOR_SAMPLES * SAMPLE_SIZE + i] = *(time_start + i);
        mag_characteristic_data[MAX_SENSOR_SAMPLES * SAMPLE_SIZE + i] = *(time_start + i);
    }
    acc_characteristic_data[MAX_SENSOR_SAMPLES * SAMPLE_SIZE + 4] = m_current_sensor_samples;
    gyr_characteristic_data[MAX_SENSOR_SAMPLES * SAMPLE_SIZE + 4] = m_current_sensor_samples;
    mag_characteristic_data[MAX_SENSOR_SAMPLES * SAMPLE_SIZE + 4] = m_current_sensor_samples;

    //Uncomment to see raw accelerometer bytes
    //SEGGER_RTT_WriteString(0, "Accelerometer data.");
    //for (int i = 0; i < m_current_sensor_samples * 6; i++)
    //{
    //    if (i % 6 == 0) SEGGER_RTT_WriteString(0, "\n");
    //    SEGGER_RTT_printf(0, "0x%x ", acc_characteristic_data[i]);
    //}
    //SEGGER_RTT_WriteString(0, "\n\n");

    //Setup accelerometer notification first
    acc_notify_params.type = BLE_GATT_HVX_NOTIFICATION;
    acc_notify_params.handle = m_ss.data_handles[0].value_handle;
    acc_notify_params.p_data = acc_characteristic_data;
    acc_notify_params.p_len  = &acc_data_characteristic_size;
    acc_notify_params.offset = 0;

    //Setup gyroscope notification second
    gyr_notify_params.type = BLE_GATT_HVX_NOTIFICATION;
    gyr_notify_params.handle = m_ss.data_handles[1].value_handle;
    gyr_notify_params.p_data = gyr_characteristic_data;
    gyr_notify_params.p_len  = &gyr_data_characteristic_size;
    gyr_notify_params.offset = 0;

    //Setup magnetometer notification third
    mag_notify_params.type = BLE_GATT_HVX_NOTIFICATION;
    mag_notify_params.handle = m_ss.data_handles[2].value_handle;
    mag_notify_params.p_data = mag_characteristic_data;
    mag_notify_params.p_len  = &mag_data_characteristic_size;
    mag_notify_params.offset = 0;

    //Send out notifications for each data characteristic, however, we
    //can only do so if there's enough room in the notification queue.
    if (m_notification_done)
    {
        uint32_t ret = sd_ble_gatts_hvx(m_conn_handle, &acc_notify_params); //acc data notification
        data_notification_error_handler(&ret);
        if (ret == 0x69)
        {
            return; //too many notifications in queue, wait until next cycle to send data
        }

        ret = sd_ble_gatts_hvx(m_conn_handle, &gyr_notify_params); //gyr data notification
        data_notification_error_handler(&ret);
        if (ret == 0x69)
        {
            return; //too many notifications in queue, wait until next cycle to send data
        }

        ret = sd_ble_gatts_hvx(m_conn_handle, &mag_notify_params); //mag data notification
        data_notification_error_handler(&ret);
        if (ret == 0x69)
        {
            return; //too many notifications in queue, wait until next cycle to send data
        }
    
