rfloyd01/PersonalCaddie/Firmware/nRF52840_Drivers/main.c
        APP_ERROR_CHECK(ret);
    }
}

uint64_t findGCD(uint64_t a, uint64_t b)
{
    if (b == 0) return a;
    return findGCD(b, a % b);
}

uint64_t findLCM(uint64_t a, uint64_t b)
{
    return (a * b) / findGCD(a, b);
}

float findDecimalLCM(float a, float b)
{
    return findLCM(a * 1000000, b * 1000000) / 1000000.0;
}

void calculate_samples_and_connection_interval()
{
   //This method is used to select the number of samples to store and the 
   //data characteristics as a function of the current sensor ODR and connection interval.
   //We want to minimize the amount of lag that occurs with the image on screen,
   //which is accomplished by minimizing the data collection time. 

   //After some testing, 80 milliseconds seems to be a good target time for the connection interval.
   //There is a small lag seen on the screen in this case, but not really that noticeable,
   //and it allows us to collect at least a few samples at lower ODR values, which is 
   //more efficient than sending out samples 1 at a time.

   float desired_lag_time = 0.08; //in seconds.
   m_current_sensor_samples = current_sensor_odr * desired_lag_time;
   if (m_current_sensor_samples > MAX_SENSOR_SAMPLES) m_current_sensor_samples = MAX_SENSOR_SAMPLES;
   SEGGER_RTT_printf(0, "%d sensor samples have been selected.\n", m_current_sensor_samples);

   //Calculate the actual lag time in milliseconds. Subtract 1 millisecond to guarantee
   //a longer data collection time than connection interval
   int actual_lag_time = 1000.0 * m_current_sensor_samples / current_sensor_odr - 1; 
   
   desired_maximum_connection_interval = actual_lag_time - (actual_lag_time % 15); //round down to the nearst 15th millisecond
   desired_minimum_connection_interval = desired_maximum_connection_interval - 15;
}

void set_sensor_samples(int actual_connection_interval)
{
    //This method is used to make sure we maximize the number of sensor samples to store in 
    //the data characteristics. While the calculate_samples_and_connection_interval()
    //method above also does this, we have no way of knowing what the connection interval
    //will be until after it's negotiated between the gatt server and client. Once we have
    //the actual time interval, we use this method just to make sure the number of 
    //samples we've selected works out. For example, if the current samples we want to collect
    int maximum_samples = current_sensor_odr * (float)actual_connection_interval / 1000.0;
    if (maximum_samples > MAX_SENSOR_SAMPLES) maximum_samples = MAX_SENSOR_SAMPLES;

    if (maximum_samples > m_current_sensor_samples)
    {
        m_current_sensor_samples = maximum_samples;
        SEGGER_RTT_printf(0, "%d sensor samples have been selected.\n", m_current_sensor_samples);
    }
}

void data_read_handler(int measurements_taken)
{
    //Everytime the data reading timer goes off we take sensor readings and then 
    //update the appropriate characteristic values. The timer should go off SENSOR_SAMPLES times
    //every connection interval
    imu_comm.acc_comm.get_data(acc_characteristic_data, SAMPLE_SIZE * measurements_taken);
    imu_comm.gyr_comm.get_data(gyr_characteristic_data, SAMPLE_SIZE * measurements_taken);
    imu_comm.mag_comm.get_data(mag_characteristic_data, SAMPLE_SIZE * measurements_taken);
    //SEGGER_RTT_printf(0, "Readings complete at %d\n", get_current_data_time());
}


//Functions for updating sensor power modes and settings
static void sensor_idle_mode_start()
{ 
    //In this mode, the appropriate TWI bus(es) is active and power is going to the sensors but the 
    //sensors are put into sleep mode. A red LED on the board blinks during this mode
    if (current_operating_mode == SENSOR_IDLE_MODE) return; //no need to change anything if already in idle mode

    //swap to the red LED, also make sure that the blue and green LEDs are off
    active_led = RED_LED;
    nrf_gpio_pin_set(GREEN_LED); //LEDs must be set high to turn off
    nrf_gpio_pin_set(BLUE_LED); //LEDs must be set high to turn off

    ret_code_t err_code;

    if (current_operating_mode == SENSOR_ACTIVE_MODE)
    {
        //If we're transitioning from active to idle mode we need to stop the data collection timer
        //and then put the sensor into sleep mode.
        data_timers_stop();
        
        //Put all sensors into idle mode, any of the sensors that are active
        //will be properly initialized
        lsm9ds1_idle_mode_enable();
        fxos8700_idle_mode_enable();
        fxas21002_idle_mode_enable();

        //the LED is deactivated during data collection so turn it back on
        led_timers_start();
    }
    else 
    {
        //If we aren't in sensor active or idle mode, it means that we arrived here from connection mode.
        //This means that both the TWI bus and sensors need to be turned on. There are two reasons why we'd
        //be turning on the sensors, either we're about to take data readings, or, we want to update the
        //sensor settings. In both cases we need to turn on the TWI bus to enable communication, but
        //before doing so we need to see if a call from the front end to use a different sensor has been made.
        uint8_t new_sensors = 0;

        if (imu_comm.sensor_model[ACC_SENSOR] != sensor_settings[ACC_START + SENSOR_MODEL])
        {
            new_sensors |= 0b001;
            default_sensors[ACC_SENSOR] = sensor_settings[ACC_START + SENSOR_MODEL];
            sensors_initialized[ACC_SENSOR] = false;
        }

        if (imu_comm.sensor_model[GYR_SENSOR] != sensor_settings[GYR_START + SENSOR_MODEL])
        {
            new_sensors |= 0b010;
            default_sensors[GYR_SENSOR] = sensor_settings[GYR_START + SENSOR_MODEL];
            sensors_initialized[GYR_SENSOR] = false;
        }
        
        if (imu_comm.sensor_model[MAG_SENSOR] != sensor_settings[MAG_START + SENSOR_MODEL])
        {
            new_sensors |= 0b100;
            default_sensors[MAG_SENSOR] = sensor_settings[MAG_START + SENSOR_MODEL];
            sensors_initialized[MAG_SENSOR] = false;
        }

